In [1]:
import pandas as pd
import numpy as np

In [4]:
lst1 = []
lst2 = []
for x in range(1,10):
    lst2.append(x)
    lst1.append(100/x)

In [5]:
df = pd.DataFrame({
    "int":lst2,
    "float":lst1
})

In [6]:
df

   int       float
0    1  100.000000
1    2   50.000000
2    3   33.333333
3    4   25.000000
4    5   20.000000
5    6   16.666667
6    7   14.285714
7    8   12.500000
8    9   11.111111

In [15]:
p = pd.DataFrame(df.iloc[3,:])

          3
int     4.0
float  25.0

In [25]:
type(df[df["int"] > 10])

pandas.core.frame.DataFrame

In [26]:
"2013-10-01" < "2013-10-03"

True

In [27]:
df

   int       float
0    1  100.000000
1    2   50.000000
2    3   33.333333
3    4   25.000000
4    5   20.000000
5    6   16.666667
6    7   14.285714
7    8   12.500000
8    9   11.111111

In [36]:
type(df[(df["int"] > 4 ) | (df["int"] < 8)])

pandas.core.frame.DataFrame

In [54]:
type(df.iloc[:,[1]])

pandas.core.frame.DataFrame

In [55]:
a = pd.Series({"A":[1,2,3,4,5]})

In [56]:
a

A    [1, 2, 3, 4, 5]
dtype: object

In [57]:
type(a)

pandas.core.series.Series

In [58]:
df

   int       float
0    1  100.000000
1    2   50.000000
2    3   33.333333
3    4   25.000000
4    5   20.000000
5    6   16.666667
6    7   14.285714
7    8   12.500000
8    9   11.111111

In [61]:
df.columns

Index(['int', 'float'], dtype='object')

In [62]:
len(df.columns) # length of a column

2

In [65]:
type(df.columns)

pandas.core.indexes.base.Index

In [66]:
columns = df.columns
for x in columns:
    print(x)

int
float

In [67]:
df.columns = ["A","B"]

In [68]:
df

   A           B
0  1  100.000000
1  2   50.000000
2  3   33.333333
3  4   25.000000
4  5   20.000000
5  6   16.666667
6  7   14.285714
7  8   12.500000
8  9   11.111111